#language: ru
  Функционал: Яндекс маркет
    Сценарий: Выбор телевизора

      Когда выбран Яндекс Маркет

      Когда выбран пункт меню "Электроника"
      И выбран пункт под меню "Наушники и Bluetooth-гарнитуры"

      Когда установлено количество элементов на странице - "12"

      Когда задан параметр поиска от "5000" рублей
      
      Когда выбран производитель "Beats"
      
      Тогда проверено количество элементов на странице, ожидаемое значение "12"
      
      Когда выбран "0" элемент из списка
      Тогда проверено название результата поиска