#language: ru
  Функционал: Яндекс маркет
    Сценарий: Выбор телевизора

      Когда выбран Яндекс Маркет

      Когда выбран пункт меню "Электроника"
      И выбран пункт под меню "Телевизоры"

      Когда установлено количество элементов на странице - "12"

      Когда задан параметр поиска от "20000" рублей
      
      Когда выбран производитель "Samsung"
      И выбран производитель "LG"

      Тогда проверено количество элементов на странице, ожидаемое значение "12"
      
      Когда получено название элемента с индексом "0" и выполнен поиск
      Тогда проверено название результата поиска